import 'dart:ui';
import 'package:btsworld/curriculumvitae/info_person.dart';
import 'package:btsworld/style/style.dart';
import 'package:flutter/material.dart';

class CurriculumVitae extends StatefulWidget {
  const CurriculumVitae({Key? key}) : super(key: key);
  @override
  _CurriculumVitaeState createState() => _CurriculumVitaeState();
}

class _CurriculumVitaeState extends State<CurriculumVitae> {
  List infoperson = [
    {
      'id':    1 ,
      'name': 'agust d',
      'dec':  'مين يونقي (هانغل: 민윤기) وُلد في 9 مارس 1993 في دايغو في كوريا الجنوبية، معروف باسمه الفني شوقا وAgust D وهو مُغني راب وكاتب أغاني ومنتج كوري جنوبي. وفي عام 2013، تم ترسيمه كعضو ضمن الفرقة الغنائية الكورية الجنوبية بي تي أس تحت شركة بيغ هيت إنترتينمنت. أصدر أول ألبوم ميكستايب له في 16 أغسطس 2016 بعنوان أوقست دي. أسندت له جميعة حقوق التأليف والنشر الموسيقي في كوريا أكثر من 100 أغنية ككاتب أغاني ومُنتج، بما في ذلك أغنية سوران "واين"، التي احتلت المركز الثاني في مخطط غاون للموسيقى وفازت بجائزة أفضل مسار بفئة سول/آر أن بي في عام 2017 بحفل جوائز ميلون الموسيقي. وفي عام 2020، أصدر الميكستايب المُنفرد الثاني دي-تو.',
      'img': 'img/agust.jpg',
      'live': 'ولد مين يونقي في 9 مارس بعام 1993 في دايغو، كوريا الجنوبية. هو الابن الأصغر لعائلة مُكونة من ولدين، التحق بمدرسة تايجوان الابتدائية ومن ثم مدرسة جوانيم الاعدادية، ومدرسة أبجوجيونج الثانوية. أصبح مُهتمًا بالراب بعد سماعه أغنية "Reggae Muffin" لفرقة ستوني سكانك مُوضحًا بأنها كانت مختلفة عن أي شيء كان قد سمعه من قبل. وقد اتخذ قراره في أن يصبح مغني راب بعد أن استمع لفرقة إيبك هاي. في سن الـ 13 عامًا، بدأ بكتابة كلمات الأغاني وتعلم أكثر عن ميدي. في سن الـ17 عمل في وظيفة بدوام جزئي ومُنذ ذلك الحين، بدأ يونقي في تأليف وترتيب الموسيقى والراب وتأديته. قبل تسجيله أي عقد مع أي وكالة كان فنانًا نشطًا تحت لقب Gloss باعتباره أندرقراوند رابر. كعضو من طاقم هيب هوب D-Town في عام 2010 أنتج أغنية "062-518" احياءً لذكرى انتفاضة غوانغجو'  ,
      'technical_name' : 'الاسم الفني هو شوقا (هانغل: 슈가) مُشتق من المقطع الأول لمصطلح مسدد الكرات (هانغل: 슈팅 가드)، وهو المركز الذي كان يشغله خلال لعبه لكرة السلة في المدرسة. وقد تم اختيار اسم المستعار "AGUST D" في عام 2016 من أجل أول ميكستايب له والذي كان مشتق من الأحرف الأولى DT الاختصار لمكان ولادته "مدينة دايغو" أما AGUS فهو اسم شوقا مكتوب بالعكس.' ,
      'technical_abilities': 'شوقا مسؤول عن عمليات الكتابة والتأليف والتوزيع والدمج والماسترنغ. ولديه أكثر من 70 أغنية مُسجلة في جمعية حقوق التأليف والنشر الموسيقي في كوريا تحت أسم شوقا. وهو عازف بيانو كما ينتج موسيقى الهيوب هوب وموسيقى الآر أند بي. دائمًا ما تتضمن كلماته مواضيع مُهمة "مليئة بالأحلام والأمل" تم تنفيذها وكتابتها بنية أن تصبح موسيقاه "قوة للكثير من الناس". مثله الأعلى في الموسيقى هم إيبك هاي وستوني سكونك واتخذهم كمصدر إلهام له لمواصلة عمله في موسيقى الهيب هوب. وعلى وجه التحديد ألبوم الريغي والهيب هوب " Ragga Muffin" الذي صدر عام 2005 وأغنية ألبومهم الرئيسية التي أشعلت اهتمامه بهذا النوع.'   ,
      'position_influence':  'في استطلاع أجرته شركة غالوب الكورية احتل شوقا المرتبة الثالثة عشرة في قائمة الآيدول المُفضلين من قِبل العامة لعام 2017. وفي استطلاعات 2018 احتل المرتبة السابعة واحتل المرتبة التاسعة في 2019.'  ,
      'his_personal_life':  'بدأ العيش في هانام-دونق، سول، كوريا الجنوبية مُنذ عام 2019. وفي عام 2018، اشترى شقة فاخرة بقيمة 3 ملايين دولار في كوريا الجنوبية لكنه لا يزال يعيش في هانام-دونق. في عام 2014، وعد بشراء لحم لمُعجبيه إذا نجح كفنان موسيقيّ. بعد أربع سنوات، في يوم ميلاده الخامس والعشرين، تبرع بلحم بقر لـ39 دارًا للأيتام باسم "الآرمي" اسم قاعدة معجبين بي تي أس. وفي عيد ميلاده السادس والعشرين، تبرع بمبلغ 100,000,000 وون بما يُعادل 88,000 ألف دولار لمؤسسة سرطان الأطفال الكورية إلى جانب 329 دمية لشخصية شوكي' ,
    } ,
    {
      'id':    2 ,
      'name': 'آر إم',
      'dec':  'كيم نام جون (هانغل: 김남준) من مواليد (12 سبتمبر 1994 - ) المعروف بإسم آر إم (عُرِفَ سابقًا بِـراب مونستر)، هو مغني راب، ومغني، وكاتب أغاني، ومنتج وكاتب في شركة بيغ هيت، وهو قائد فرقة بي تي أس الكورية. في عام 2015، قام بإصدار أول ميكستايب مُنفرد له باسم "آر إم". واعتبارًا من أكتوبر 2018، أصبح الميكستايب الثاني له "مونو" أعلى ألبوم لفنان كوري مُنفرد يتم ترسيمه على مخطط بيلبورد 200، وذلك بعد بلوغه أعلى مركز يحققه في المخطط وهو المركز الـ26. وتعاون مع الكثير من الفنانين منهم وال، ارين جي، جايكو، كريز كاليكو، فول آوت بوي، برايمري، وليل ناز إكس.' ,
      'img': 'img/arm.jpg',
      'live': 'كيم نامجون (هانغل: 김남준) وُلد في 12 سبتمبر 1994، في محافظة دونقجاك في كوريا الجنوبية، وكَبُر في إلسانغو، وهي المنطقة التي انتقلت إليها عائلته عُندما كان في الرابعة أو الخامسة من العُمر. وهو الشقيق الأكبر حيث أنه لديه أختٌ صغرى. عندما كان آر إم طفلًا، تعلم اللغة الإنجليزية إلى حدٍّ كبير وذلك من خلال مشاهدة مسلسل (فريندز) مع والدته. وعندما كان طالبًا، كان يكتب الشعر بصورة نَشِطة وحصل على جوائز لكتاباته في أحيانٍ كثيرة. كما أنه قام بنشر أعماله على موقعٍ للشعر على الإنترنت لما يقارب عامًا واحدًا، حيث أنه لفت الانتباه بشكلٍ متوسط. ومن خلال ذلك، ازداد اهتمام آر إم بمواصلة المسار المهني الأدبي لكنه قرر قرارًا مضادًّا لذلك. في سن الحادي عشر، أصبح آر إم مهتمًّا بموسيقى الهيب هوب بعد سماعه أغنية "فلاي" لِفرقة إيبك هاي في الصف الخامس. حيث وجد أن الأغنية وفرت له الراحة، ونتيجةً لذلك، قرر البحث بشكل أكبر في هذا النوع. وبعد مقدمة ألقاها معلمه عن مغني الراب الأمريكي إمينيم، إزداد اهتمام آر إم بالشعر الغنائي، وطباعة كلمات الشعر التي يشعر بأنها "رائعة" ومشاركتها مع أصدقائه. توجه آر إم لكتابة الكلمات، وذلك بعد أن اتضح له بأن شِعْره يتحول إلى كلماتٍ عند اقترانه بالموسيقى. في عام 2007، وبصفته طالبًا في سنته الأولى من المرحلة الإعدادية، بدأ آر إم بغناء الراب في دوائر الهيب هوب المحلية للهواة، وأنشأ وللمرة الأولى أول تسجيل ذاتي التأليف له باستخدام برنامج أدوبي أوديشن (عُرِف سابقًا بِـكول إديت). كما أنه شارك لاحقًا في أول حفلٍ موسيقي له في عام 2008. وفي نهاية المطاف أصبح آر إم أكثر نشاطًا في مجال الهيب هوب الكوري وتحديدًا الأندر قراوند تحت اسم (رانش راندا)، حيث أطلق عددًا من المسارات وتعاون مع مغنيين راب أندر قراوند آخرين، مثل زيكو.' ,
      'technical_name' : 'اختار آر إم اسم "راب مونستر" خلال الفترة التي كان فيها آيدول متدرب. على الرغم من سوء الفهم الشائع بأن الاسم يعني بأنه "يقوم بغناء الراب كالوحش"، فإن المعنى في الواقع مشتق من كلمات أغنيةٍ قد كتبها، وهي مستوحاة من أغنية "راب جينيَس" لمغني الراب سان إي. حيثُ احتوت الكلمات على مقطعٍ يصرِّح فيه سان إي بوجوب تلقيبه بِـ"راب مونستر" لأنه "يغني الراب بلا توقف". وهكذا اتخذه اسمًا فنيًّا له لأنه شعر بأنه "رائع". آر إم وصف نفسه كَـاللذي يحظى بعلاقة حب وكراهية مع الاسم، وشَعَرَ بأنه لم يقم باختياره لكونه "ذو قيمة لا تُصدَّق" بالنسبة له. قام آر إم بتغيير اسمه الفني إلى "آر إم" رسميًا في نوفمبر 2017، كما أنه حسم الأمر بأن "راب مونستر" لم يعد يمثِّل من هو أو الموسيقى التي أنشأها. وفي مقابلة مع برنامج إنترتاينمنت تونايت صرَّح آر إم بأن "[RM] يمكن أن يرمز إلى أشياء عديدة. ويمكن أن يكون له أبعاد كثيرة". وقد ذكر "Real Me" كَـمعنى حالي مُحتمل.',
      'technical_abilities': 'في عام 2009، خاض آر إم تجربة أداء في وكالة بيق ديل ريكوردز، واجتاز الجولة الأولى مع صموئيل سيو ولكنه فشل في الجولة الثانية حيث أنه نسي جميع كلماته. على أي حال، بعد تجربة الأداء قام مغني الراب سليبي بتبادل معلومات الاتصال مع آر إم، حيث أنه هو من قام بذكره لاحقًا لمنتج وكالة بيغ هيت الترفيهية Pdogg. وفي عام 2010، تواصل سليبي مع آر إم مشجعًا إياه لخوض تجربة أداء لدى الرئيس التنفيذي لوكالة بيغ هيت بانق شيهيوك، وعرض شيهيوك على آر إم منصبًا في شركة التسجيلات، وبدون علم والديه، قَبِلَ آر إم العرض على الفور. كان هذا التفاعل سببًا في بدء شيهيوك وPdogg بتكوين فرقة هيب هوب، والتي أصبحت في نهاية الأمر فرقة بي تي أس. وبعد ذلك بوقت قصير انضم آر إم إلى وكالة بيغ هيت الترفيهية في سن الـ16. وخلال حياته المهنية كَـآيدول، التحق بجامعة سايبر العالمية.',
      'position_influence': 'نوع صوت آر إم هو باريتون. في عام 2017، قامت مجلة الهيب هوب الأمريكية إكس إكس إل بإصدار قائمة بِـعنوان "10 مغنيين راب كوريين يجب عليك معرفتهم"، والتي ضمَّت آر إم. حيث يَعِدُ الكاتب بيتر بيري قائلًا بأنه "لَمِنَ النادر فشل راب مونستر في الارتقاء إلى مستوى اسمه". كما أنه قام بِـوصف النجم الشاب بأنه "واحد من أكثر مغنيِّ الراب براعةً في المنطقة، والأكثر مهارةً في تبديل التدفقات دون عناء كما لو كان يقوم بالتزلُّج بِـشكلٍ متناسقٍ بين شتى أنواع المعزوفات".' ,
      'his_personal_life':  ''
    } ,
    {
      'id':    3,
      'name': 'جايهوب',
      'dec':   'جونق هوسوك (بالإنجليزية: Jung Ho-seok)‏ (هانغل: 정호석) معروف باسمه الفني جايهوب (بالإنجليزية: J-Hope)‏ (هانغل: 제이홉) مغني راب وراقص وملحن ومصمم رقصات كوري جنوبي. بدأ مسيرته الفنية سنة 2013 بعد ترسيمه في الفرقة الكورية بي تي أس تحت إدارة وكالة بيغ هيت الترفيهية. أصدر جايهوب أول ميكستايب منفرد له "هوب ورلد" عالميًا في الأول من شهر مارس عام 2018. وقد تلقى الميكستايب قبولًا إيجابيًا حين صدوره. حيث أن ترسم في المركز 63 (وارتفع لاحقًا للمركز 38) جاعلًا منه الفنان الكوري المُنفرد الأعلى مرتبة في مخطط بيلبورد 200 وقت صدور الميكستايب. وفي 27 سبتمبر عام 2019، أصدر أغنية "تشيكن نودل سوب" بالتعاون مع بيكي جي.',
      'img': 'img/J-hope.jpg',
      'live': 'ولد جايهوب في الـ18 من شهر فبراير عام 1994 بغوانغجو، كوريا الجنوبية، حيثُ عاش في مسقط رأسه مع والديه وأخته التي تكبره بأربع سنوات. قبل ترسيمه مع بي تي أس كان عضوًا في فريق الرقص الأندرغراوند نيورون وتلقى دروس الرقص في أكاديمية غوانغجو الموسيقية. كان جايهوب ذو شعبية بفضل مهاراته في الرقص قبل ترسيمه؛ وقد فاز بجوائز محلية مُتعددة للرقص بالإضافة إلى حصوله على المركز الأول في مسابقة رقص دولية عام 2008. مهاراته في الرقص قادته في النهاية إلى الاهتمام بالغناء، وساعدته على التقدم لتجارب الأداء كآيدول، وأصبح مُتدرب في شركة بيغ هيت الترفيهية عام 2010. بينما لا يزال مُتدربًا شارك كرابر في أغنية جو كون "Animal" التي تم إصدارها عام 2012.' ,
      'technical_name' : 'اسمه الفني هو جايهوب (هانغل: 제이홉)، أتى من رغبته في تمثيل "الأمل" من أجل مُعجبيه بالإضافة إلى أن يصبح أمل فرقة بي تي أس. وهو أيضًا مُستوحى من أسطورة "صندوق باندورا"، حيث أنه عندما تم فتح الصندوق وخرجت جميع الشياطين من الداخل إلى العالم الشيء الوحيد الذي تبقى هو الأمل.' ,
      'technical_abilities':  '' ,
      'position_influence': 'في عام 2018، حصل جايهوب على جائزة وسام الاستحقاق الثقافي من الدرجة الخامسة لهواقوان من طرف رئيس كوريا الجنوبية إلى جانب باقي أعضاء الفرقة. كما أنه يمتلك التغريدة الأكثر إعجابًا في العالم لسنة 2018 عندما شارك بتحدي "In My Feelings Challenge".' ,
      'his_personal_life':  'في عام 2016، قام جايهوب بشراء شقة فخمة في كوريا الجنوبية تصل قيمتها إلى 1.6 مليون دولار لاستعمالاته الخاصة. وبعام 2019، أقام في هانام-دونق بسيؤول، كوريا الجنوبية مع أعضاء فرقته.'
    } ,
    {
      'id':    4,
      'name': 'جونقكوك',
      'dec':   'جيون جونقكوك (هانغل: 전정국) ولد في 1 سبتمبر 1997، يشتهر ويُعرف أكثر بأسمه الفني جونقكوك (يُنطق جونغ كوك)، هو مُغني كوري، وكاتب أغاني، ومُنتج تسجيلات. هو عضو ومغني صوتي رئيسي لفرقة بي تي أس الكورية.' ,
      'img': 'img/Jungkook.jpg',
      'live':  'جون جونقكوك (هانغل: 전 정 국) وُلد في 1 سبتمبر 1997 في بوسان، كوريا الجنوبية. تتكون عائلته من والديه وأخوه الأكبر. درس المرحلة الابتدائية والمتوسطة في مدرسة بايكيانغ في بوسان. عندما أصبح مُتدرب نُقل إلى مدرسة سينقو المتوسطة في سيؤل. في بادئ الأمر كانت أحلام جونقكوك عُندما كان صغيرًا أن يُصبح لاعب تنس ريشة ولكن عندما رأى أداء جي دراغون لأغنية هارت بريكير على التلفاز، ألهمهُ ذلك في أن يُصبح مُغنيًا.' ,
      'technical_name' : '' ,
      'technical_abilities':  'تم إجراء استطلاع في عام 2019 بواسطة مؤسسة غالوب الكورية، صُنف جونقكوك بالمركز الثالث لأكثر المشاهير شهرةً في كوريا الجنوبية. كان ظهوره الأول في القائمة في عام 2016 ولقد كان بالمركز 20، ثم احتل المركز 17 في عام 2017، ثم المركز الثامن في عام 2018. في عام 2018، احتل جونقكوك المركز الأول لمدة 10 أسابيع متتالية في مجلة ‘Hi China’ ضمن قائمة المشاهير المحبوبين في الصين. في أكتوبر عام 2018 حطم جونقكوك الرقم القياسيّ لأكثر عدد مشاهدين في الوقت حالي في تاريخ تطبيق في لايف خلال بثه المباشر المنفرد مع أكثر من 3,7 مليون مشاهد عالميًا. في ديسمبر 2018 كانت تغريدة جونفكوك التي كانت عبارة عن مقطع فيديو له وهو يغني في الاستوديو الخاص به أكثر تغريدة مُعاد تغريدها في كوريا الجنوبية في ذلك العام. العديد من الفنانين قاموا بإختياره كمؤثر وكقدوة لهم، منهم كيم دونغ هان وهيونق سيوب أكس إيوونق. في يناير عام 2019 كشف جونقكوك أنه يستخدم العلامة التجارية داوني منعم ومُلطف الأقمشة لغسل ملابسه. مما أدى ذلك إلى ارتفاع غير متوقع في مبيعات العلامة التجارية وبيع المنتج بالكامل لمدة شهرين متتالين، و ارتفعت أسهم الشركة التجارية حوالي 11% في ذلك اليوم. تم بيع النبيذ Merlot March wine  الذي كان يشربه جونقكوك أثناء بثه على تطبيق لـV Live بالكامل بعد وقت قصير من البث. بعد أن تبين أن جونقكوك كان يقرأ كتاب "قررت أن أعيش كما أنا" للمؤلف كيم سوهيون، أصبح الكتاب من أكثر الكتب مبيعاً في كلٍ من كوريا واليابان، كما أصبح الكتاب الكوري الأكثر مبيعاً في اليابان في تلك الفترة القصيرة (تم بيع أكثر من 150 ألف نسخة في ثلاثة أشهر) تم نسب الفضل لحدوث ذلك إلى جونقكوك، وكان من المقرر نشر الكتاب أيضاً في دول أخرى، مثل تايلند والصين وإندونيسيا. في يوليو عام 2019 أرتدى جونقكوك زي الهانبوك في المطار، أفادت شركة ‘Zijangsa’ أن الخادم توقف عن العمل واضطرت الشركة إلى تأخير عمليات التسليم لمدة ثلاثة أسابيع بسبب كثرة الطلبات. في سبتمبر عام 2019 ذكرت وسائل الإعلام الكورية أن جونقكوك أبتكر موضة الهانبوك في الصناعة الترفيهية الكورية، العديد من المشاهير بدأوا بإرتداهُ بسبب جونقكوك مثل؛ جون هيون مو، جانغ دو يون، غونغ هيو جن ومقدم الأخبار سيونق هوان ومقدم برنامج عودة سوبرمان بارك جو هو. في عام 2019 تم تصنيف جونقكوك بالمركز الأول كالأيدول الكوري الأكثر بحثًا في مخطط منتصف العام لأعلى 50 عملية بحث عالمياً في جوجل لعام 2019، والذي تم اصداره من جوجل.' ,
      'position_influence':  '' ,
      'his_personal_life':   ''
    } ,
    {
      'id':    5,
      'name': 'في',
      'dec':  'كيم تاي هيونق (هانغل: 김태형) وُلد في (30 ديسمبر 1995 - ) يُعرف باسمه الفني V أو ڤي، مغني وكاتب أغاني وممثل كوري جنوبي. وهو عضو ومُغني رئيسي في الفرقة الكورية الجنوبية بي تي أس.' ,
      'img': 'img/kVuRHcR.jpg',
      'live':   'وُلد كيم تاي هيونق (هانغل: 김태형) المعروف بـ ڤي في 30 ديسمبر 1995 في دايغو، كوريا الجنوبية، وكَبُر في محافظة غوتشانغ. لديه أخ وأخت وهو أكبرهم. أول مرة طمح فيها لاحتراف الغناء كانت في المرحلة الإبتدائية، وفي بداية المرحلة المتوسطة بدأ بأخذ دروس لتعلم العزف على آلة الساكسفون كوسيلة لمتابعة مساره المهني. وافق والده على رحلة ابنه لتعلم العزف على آلة الساكسفون. في البداية، أصبح ڤي مُتدربًا لدى شركة بيغ هيت إنترتينمنت وذلك بعد اجتيازه الاختبار في دايغو.' ,
      'technical_name' : 'في 13 يونيو 2013، ظهر كعضو في فرقة بي تي أس لأول مرة عند أداء أغنية "نو مور دريم" من الألبوم المنفرد الأول لهم "2 كول 4 سكول" في برنامج إم كاونت داون على قناة إمنت. ثُم أصبح لديه حقوق في التأليف الموسيقي لأول مرة في ألبوم "أفضل لحظة في الحياة الجزء الأول" عندما شارك في كتابة وإنتاج أغنية "هولد مي تايت". كما ساهم في كتابة كلمات أغنية "بويز وذ فن" التي ساهم في تأليفها زميله شوقا. تم استخدام ألحان ڤي مع كلمات جونقكوك الأصلية في أغنية "رن" من أجل الألبوم التالي أفضل لحظة في الحياة الجزء الثاني. بالإضافة إلى ذلك، ساهم في التأليف الموسيقي وكتابة الكلمات لأغنيته المنفردة "ستيقما" من ألبوم وينقز. ڤي أيضًا قام بالإصدار بشكل غير رسمي عن غلاف لأغنية "Hug Me" مع زميله بالفرقة جايهوب بالإضافة إلى غلاف آخر لأغنية "سمون لايك يو" للمغنية أديل.' ,
      'technical_abilities':  'ابتكر ڤي عبارة "I Purple You" أثناء حدث لقاء المعجبين الخاص بِـبي تي أس في نوفمبر 2016. مُنذ ذلك الحين أصبح اللون الأرجواني رمزًا لِـبي تي أس ومُعجبيهم. كما استخدمت منظمة يونيسف هذه العبارة في حملتها لمكافحة التنمر بالتعاون مع بي تي أس.' ,
      'position_influence':  'ڤي لديه طبقة صوت من نوع باريتون والذي تلقَّى صوته نقدًا إيجابيًا بشكل عام، مع الإشادة بشكلٍ خاص على مدى نطاقه الصوتي وطبقة صوته "الأجش". حصل على تقدير صوتي شاسع من أجل أدائه لأغنيته الفردية "ستيقما"، كما تم الثناء على حدَّة طبقة صوته والتي ظهرت بشكل أعلى من المعتاد مما أبرز نطاقه الصوتي وموسيقاه الفريدة. أشار الناقد الموسيقي بلانكا مينديز إلى طبقة صوت ڤي في أغنية "سينقيولاريتي" وهي مقدمة ألبوم بي تي أس لوف يور سيلف: تير على أنها "طبقة الصوت الأبرز" في الألبوم. كما ذكرت كارين روفيني في مقال لها على إليت دايلي بأن "ڤي... لا يوجد لديه مشكلة في إخراج نغمات صوتية في غاية الهدوء والإنخفاض والتي تعد عنصرًا أساسيًا في الصوت العام لِـبي تي أس،" وأشارت تمار هيرمان من مجلة بيلبورد أيضًا إلى أن نطاق صوت ڤي المنخفض هو جزءٌ بارز من موسيقى بي تي أس. تتأثر موسيقى ڤي بشكلٍ كبير بحبه لموسيقى الجاز والموسيقى الكلاسيكية. كما أن إيريك بينيت وروبن ستودارد من ضمن مُلهميه.' ,
      'his_personal_life':   ''
    } ,
    {
      'id':   6,
      'name': 'جيمين',
      'dec':  'بارك جيمين (هانغل: 박지민)، وُلد في (13 أكتوبر 1995 - )، المعروف باسم جيمين، هو مغني كوري جنوبي، وكاتب أغاني، وراقص. بدأت مسيرته الفنيّة حين ترسّم في عام 2013 كعضو في فرقة الفتيان الكورية بي تي أس، تحت إدارة شركة بيغ هيت إنترتينمنت، ويشغل فيها دور راقص رئيسي ومغني أساسي.' ,
      'img': 'img/geme.jpg',
      'live': 'بارك جيمين (هانغل: 박지민) وُلد في 13 أكتوبر 1995 في مقاطعة قوم جونق، مدينة بوسان، كوريا الجنوبية. تتكون عائلته من أمه، وأبيه، وأخ أصغر منه. حين كان صغيراً، ارتاد مدرسة هودونق الابتدائية ومدرسة يونسان المتوسطة في بوسان. حين كان طالباً في المدرسة المتوسطة، ارتاد جيمين أكاديمية "جست دانس" للرقص في بوسان وتعلّم فيها رقص البوبينق واللوكينق (فرعين من رقص الهيب هوب). وقبل أن يصبح متدرباً، درس جيمين الرقص المعاصر في مدرسة بوسان العليا للفنون وكان طالباً متميزاً من الأوائل في قسم الرقص الحديث. بعد أن اقترح عليه أحد أساتذته أن يتقدم لتجارب الأداء في إحدى وكالات الترفيه، أوصله ذلك لشركة بيغ هيت إنترتينمنت. وبمجرد أن تم قبوله كمتدرب في الشركة في عام 2012، انتقل لـ المدرسة الكورية العليا للفنون، وتخرج منها في عام 2014. جيمين ملتحق حالياً بالجامعة سايبر العالمية للدراسة عن بعد.'  ,
      'technical_name' : '' ,
      'technical_abilities':   'تم وصف صوت جيمين بأنه صوتٌ رقيقٌ ولطيف. ويعتبر راقصاً ذا موهبةٍ استثنائية من بين أعضاء فرقته وفي عالم الكيبوب بشكلٍ عام. حيث قامت الصحفية نويل ديفو، إحدى مراسلات صحيفة إليت دايلي، بالكتابة أنه عادةً ما يُمدح جيمين لحركاته "السلسة والأنيقة" إضافةً لسحره الخاص على المسرح. في فيلم بي تي أس الوثائقي برن ذا ستيج، قال جيمين بأنه يظن بأنه شخصٌ يسعى للكمال، وأنه يبذل جهده ليحاول تجنب حتى أصغر الأخطاء على المسرح كي لا يشعر بالذنب أو القلق فيما بعد.' ,
      'position_influence':   'في عام 2016، صُنّف جيمين في المركز الرابع عشر ضمن قائمة أكثر فناني الكيبوب شعبيةً في كوريا الجنوبية في الاستطلاع السنوي الذي تجريه مؤسسة غالوب الكورية. ثم ارتفع للمركز السابع في عام 2017، قبل أن يتصدر نتائج الاستطلاع في المركز الأول لعامين متتاليين في عامي 2018 و2019.' ,
      'his_personal_life':   ''
    } ,
    {
      'id':   7,
      'name': 'كيم سوك جين',
      'dec':  'كيم سوكجين (هانغل: 김석진) وُلد في 4 من ديسمبر 1992، هو أيضًا يُعرف باسمه الفني جين، هو مُغني وكاتب أغاني كوري جنوبي. وعضو في الفرقة الكورية الجنوبية بي تي أس.' ,
      'img': 'img/jin-bts-you.jpg',
      'live':  'وُلد كيم سوكجين في الرابع من ديسمبر 1992، في غواتشيون، في مقاطعة غيونغي، في كوريا الجنوبية. تتكون عائلته من 3 أفراد وهم والدته، والده وشقيقه.' ,
      'technical_name' : '' ,
      'technical_abilities':  'نوع صوت جين هو تينور كما أنَّ بإمكانه العزف على القيتار. وقد تلقّى صوته في الغناء استقبالاً إيجابيًا بشكلٍ عام. في رواية "بي تي أس: ذا ريفيو" للكاتب كيم يونق داي، ذكر أعضاءٌ من لجنة خبراء غرامي أن صوته يملك تحكمًا تنفسيًا ثابت وفالسيتو قوي، واصفين إياه بِـ "الصوت الفضي". كما كتب الصحفي تشوي سونق هاي، الذي يكتب لصالح موقع Aju News، أن أغاني بي تي أس الفردية مثل "سبرينق داي" و"فيك لوف" أبرزت الثبات الصوتي لِـجين، بينما أبرزت الأغنية الجانبية "جاميس فو" نطاقه العاطفي. وصف هونق هاي-مين من ذا كوريا تايمز صوت جين بِـ"الحنون، الحزين، والحيوي" واعتبره "عُنصرًا بارزًا" في أغنية البالاد المُنفردة "إيبفاني". وذكرت الناقدة بارك هي عند مُناقشتها لأغنية "إيبفاني"، أن جين "يقوم بغناء المشاعر الأكثر عاطفية" من بين المسارات الفردية في ألبوم لوف يور سيلف: آنسر. وفي مراجعةٍ لِـ "فيك لوف"، قالت بارك هي أن "أحزمة جين الصوتية أثبتت[تثبت] مدى فاعلية الأغنية وتأثيرها".' ,
      'position_influence':   'في عام 2018، تم تصنيفه في المرتبة الـ11 كَـأكثر آيدول معروف في كوريا الجنوبية، وذلك من خلال البيانات التي تم جمعها من قِبَل مؤسسة غالوب الكورية.' ,
      'his_personal_life':   'اعتبارًا من عام 2018، بدأ جين بالعيش في مقاطعة هانام دونق، بالعاصمة سول، كوريا الجنوبية. بالإضافة إلى ذلك، افتتح هو وشقيقه الأكبر مطعم على الطراز الياباني في سول يُسمى "Ossu Seiromushi" وذلك في عام 2018.'
    } ,
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: const Color(0xff0e1c36),
        appBar: AppBar(
          elevation: 0,
          centerTitle: true,
          backgroundColor: const Color(0xff0e1c36),
          title:  Text('سيرة ذاتية' , style: text_style_info_person,),
        ),
        body: ListView.builder(
          itemCount: infoperson.length,
          itemBuilder: (context, index) {
            return DataInfoPreson(
              id: infoperson[index]['id'],
              name: infoperson[index]['name'],
              dec: infoperson[index]['dec'],
              img: infoperson[index]['img'],
              live: infoperson[index]['live'],
              technical_name: infoperson[index]['technical_name'] ,
              technical_abilities: infoperson[index]['technical_abilities'] ,
              position_influence: infoperson[index]['position_influence'] ,
              his_personal_life: infoperson[index]['his_personal_life'] ,
            );
          },
        ));
  }
}

class DataInfoPreson extends StatelessWidget {
  final int id;
  final String name;
  final String img;
  final String dec;
  final String live;
  final String technical_name;
  final String technical_abilities;
  final String position_influence;
  final String his_personal_life;


  const DataInfoPreson(
      // ignore: non_constant_identifier_names
      {Key? key, required this.id,
        required this.name,
        required this.img ,
        required this.dec ,
        required this.live ,
        required this.technical_name ,
        required this.technical_abilities ,
        required this.position_influence ,
        required this.his_personal_life ,
      })
      : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.all(10),
      child: Container(
        decoration: BoxDecoration(
            color: Color(0xff0e1c26), borderRadius: BorderRadius.circular(13)),
        height: 125,
        child: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            InkWell(
              onTap: () {
                Navigator.push(
                    context,
                    MaterialPageRoute(
                      builder: (context) =>  InfoPerson(
                        id: id,
                        name: name,
                        dec: dec ,
                        img: img ,
                        live: live,
                        technical_name:technical_name ,
                        technical_abilities:technical_abilities ,
                        position_influence:position_influence   ,
                          his_personal_life:his_personal_life
                      ),
                    ));

              },
              child: ListTile(
                title: Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                   ClipRRect(
                     borderRadius: BorderRadius.circular(50),
                     child: Image.asset(
                       img ,
                       width: 70,
                     ),
                   )
                  ],
                ),
                subtitle:  Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                        name  ,
                    style: TextStyle(color: Colors.white , fontSize: 18),
                  ),
                ),
                trailing: Padding(
                  padding:  EdgeInsets.only(top: 20),
                  child:  Text(
                    'قراء المزيد',
                    style: TextStyle(color: Colors.white , fontSize: 16 , fontFamily: 'Cairo' ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
